jahrulnr/esp32-cozmo-system/app/tasks/src/coco.cpp
#include "tasks/register.h"
#include <esp_log.h>
#include <esp32-hal-log.h>
#include "vision/image/dl_image_draw.hpp"
#include "vision/image/dl_image_jpeg.hpp"

// Helper function to get color for different scores
std::vector<uint8_t> getScoreColor(float score, dl::image::pix_type_t pix_type) {
    std::vector<uint8_t> color;

    if (pix_type == dl::image::DL_IMAGE_PIX_TYPE_RGB565) {
        // RGB565 format: 2 bytes per pixel
        uint16_t rgb565_color;
        if (score > 0.8) {
            // High confidence: Green (0x07E0)
            rgb565_color = 0x07E0;
        } else if (score > 0.5) {
            // Medium confidence: Yellow (0xFFE0)
            rgb565_color = 0xFFE0;
        } else {
            // Low confidence: Red (0xF800)
            rgb565_color = 0xF800;
        }
        color.push_back(rgb565_color & 0xFF);         // Low byte
        color.push_back((rgb565_color >> 8) & 0xFF);  // High byte
    } else if (pix_type == dl::image::DL_IMAGE_PIX_TYPE_RGB888) {
        // RGB888 format: 3 bytes per pixel
        if (score > 0.8) {
            // High confidence: Green
            color = {0, 255, 0};
        } else if (score > 0.5) {
            // Medium confidence: Yellow
            color = {255, 255, 0};
        } else {
            // Low confidence: Red
            color = {255, 0, 0};
        }
    }

    return color;
}

// Helper function to draw bounding boxes with scores
void drawDetectionResults(dl::image::img_t &imageData, const std::list<dl::detect::result_t> &detect_results) {
    for (const auto &res : detect_results) {
        // Get color based on confidence score
        std::vector<uint8_t> color = getScoreColor(res.score, imageData.pix_type);

        if (color.empty()) {
            ESP_LOGW("coco", "Unsupported pixel format for drawing");
            continue;
        }

        // Draw bounding box
        int x1 = res.box[0];
        int y1 = res.box[1];
        int x2 = res.box[2];
        int y2 = res.box[3];

        // Ensure coordinates are within image bounds
        x1 = std::max(0, std::min(x1, (int)imageData.width - 1));
        y1 = std::max(0, std::min(y1, (int)imageData.height - 1));
        x2 = std::max(0, std::min(x2, (int)imageData.width - 1));
        y2 = std::max(0, std::min(y2, (int)imageData.height - 1));

        if (x2 > x1 && y2 > y1) {
            // Draw hollow rectangle for bounding box
            dl::image::draw_hollow_rectangle(imageData, x1, y1, x2, y2, color, 2);

            // Draw a filled circle at top-left corner to indicate confidence
            int radius = (res.score > 0.8) ? 4 : (res.score > 0.5) ? 3 : 2;
            if (x1 + radius < imageData.width && y1 + radius < imageData.height) {
                dl::image::draw_point(imageData, x1 + radius, y1 + radius, color, radius);
            }
        }
    }
}

void cocoHandlerTask(void* param) {
	static const char* tag = "cocoHandlerTask";

	const char* fileName = "/cache/annotated_frame.jpg";
	if (fileManager->exists(fileName)) {
			fileManager->deleteFile(fileName);
	}

	ESP_LOGI(tag, "set feed task to stanby mode");

	while (!cocoData)
		vTaskDelay(1000);
	
	cocoData->mode = DL_MODE_STANBY;

	TickType_t updateFrequency = pdMS_TO_TICKS(1000);
	while(1){
		if (cocoData->mode != DL_MODE_READY) {
			continue;
		}

		// Wait for image data from feed task
		dl::image::img_t imageData;
		if (xQueueReceive(cocoData->resultQue, &imageData, updateFrequency) != pdTRUE) {
      continue;
    }

		if (imageData.data == nullptr) {
			ESP_LOGI(tag, "camera data received, but empty. skipping");
			cocoData->mode = DL_MODE_STANBY;
			continue;
		}

		ESP_LOGI(tag, "camera data received");
		cocoData->mode = DL_MODE_ANALYZE;
		ESP_LOGI(tag, "analyze camera data");
    auto &detect_results = cocoDetect->run(imageData);

    // Log detection results
		ESP_LOGI(tag, "analyze done, result: %d", detect_results.size());
    for (const auto &res : detect_results) {
        ESP_LOGI(tag,
                 "category: %2d [score: %f, x1: %d, y1: %d, x2: %d, y2: %d]",
								 res.category,
                 res.score,
                 res.box[0],
                 res.box[1],
                 res.box[2],
                 res.box[3]);
    }

		if (fileManager->exists(fileName)) {
			heap_caps_free(imageData.data);
			cocoData->mode = DL_MODE_STANBY;
			continue;
		}


    // Draw bounding boxes on the image
    if (!detect_results.empty()) {
        ESP_LOGI(tag, "Drawing %d detection boxes on image", detect_results.size());
        drawDetectionResults(imageData, detect_results);
        // Encode annotated image as JPEG and save
				try {
						// Use software JPEG encoding (more compatible)
						dl::image::jpeg_img_t encoded = dl::image::sw_encode_jpeg(imageData, 0, 85);

						if (encoded.data && encoded.data_len > 0) {
								// Write JPEG data to file
								auto file = fileManager->openFileForWriting(fileName);
								if (file) {
										size_t written = fileManager->writeBinary(file,
																														static_cast<const uint8_t*>(encoded.data),
																														encoded.data_len);
										fileManager->closeFile(file);

										if (written == encoded.data_len) {
												ESP_LOGI(tag, "Saved annotated image: %s (%d bytes)", fileName, encoded.data_len);
										} else {
												ESP_LOGW(tag, "Failed to write complete annotated image");
										}
								}

								// Free encoded data
								heap_caps_free(encoded.data);
						} else {
								ESP_LOGW(tag, "Failed to encode annotated image as JPEG");
						}
				} catch (...) {
						ESP_LOGE(tag, "Exception occurred while saving annotated image");
				}
    }

    heap_caps_free(imageData.data);
		if (cocoData->mode != DL_MODE_OFF)
			cocoData->mode = DL_MODE_STANBY;
			
		vTaskDelay(updateFrequency);
	}
}

void cocoFeedTask(void* param) {
	static const char* tag = "cocoFeedTask";
	const char* fileName = "/cache/frame.jpg";

	TickType_t updateFrequency = pdMS_TO_TICKS(3000);

	if (fileManager->exists(fileName)) {
			fileManager->deleteFile(fileName);
	}

	vTaskDelay(pdMS_TO_TICKS(1000));
  setupCoco();
	camera_fb_t* fb;
	while(1){
		vTaskDelay(updateFrequency);
		if (cocoData->mode == DL_MODE_WAITING) {
			ESP_LOGI(tag, "waiting mode");
			continue;
		}

		if (notification->hasSignal(NOTIFICATION_DL)){
			switch(notification->signal(NOTIFICATION_DL)) {
			case DL_MODE_OFF:
				cocoData->mode = DL_MODE_OFF;
				continue;
				break;
			case DL_MODE_STANBY:
				cocoData->mode = DL_MODE_STANBY;
				break;
			}
		}

		if (cocoData->mode != DL_MODE_STANBY) {
			continue;
		}

		std::list<dl::detect::result_t> result;
		if (camera == nullptr) {
			continue;
		}

		cocoData->mode = DL_MODE_PROCCESS;

		camera->returnFrame(fb);
		sensor_t *s = esp_camera_sensor_get();
		s->set_hmirror(s, 1);
		s->set_vflip(s, 1);

		delay(100);
		if (!fileManager->exists(fileName)) {
			fb = camera->captureFrame();
			if (!fb) {
				ESP_LOGW(tag, "failed to get camera data");
				cocoData->mode = DL_MODE_STANBY;
				continue;
			}
			auto file = fileManager->openFileForWriting(fileName);
			if (file) {
					size_t written = fileManager->writeBinary(file, fb->buf, fb->len);
					fileManager->closeFile(file);

					if (written == fb->len) {
							ESP_LOGI(tag, "Saved image: %s (%d bytes)", fileName, fb->len);
					} else {
							ESP_LOGW(tag, "Failed to write complete annotated image");
					}
			}
	
			camera->returnFrame(fb);
			vTaskDelay(pdMS_TO_TICKS(500));
		}

		fb = camera->captureFrame(1);
		if (!fb) {
			ESP_LOGW(tag, "failed to get camera data");
			cocoData->mode = DL_MODE_STANBY;
			continue;
		}

        dl::image::img_t imageToProcess = {
			.width = uint16_t(fb->width),
			.height = uint16_t(fb->height),
			.pix_type = dl::image::DL_IMAGE_PIX_TYPE_RGB888 // pix_type_t
		};

		uint8_t* imgRes = (uint8_t*) heap_caps_malloc(fb->width*fb->height*3, MALLOC_CAP_SPIRAM);
        if (fb->format != PIXFORMAT_RGB888) {
    		fmt2rgb888(fb->buf, fb->len, fb->format, imgRes);
        } else {
            memcpy(imgRes, fb->buf, fb->len);
        }

        imageToProcess.data = imgRes;
		if (imageToProcess.data == nullptr) {
			ESP_LOGW(tag, "failed to decode camera data");
			cocoData->mode = DL_MODE_STANBY;
			continue;
		}

		if (cocoData->mode != DL_MODE_OFF){
			ESP_LOGI(tag, "camera data ready to proccess");
			cocoData->mode = DL_MODE_READY;
		}

		// Send image data to handler task via queue
		if (xQueueSend(cocoData->resultQue, &imageToProcess, updateFrequency) != pdTRUE) {
			ESP_LOGW(tag, "Failed to send image data to queue");
			cocoData->mode = DL_MODE_STANBY;
			if (imgRes) {
				heap_caps_free(imgRes); // Free decoded JPEG data
			}
		}
		vTaskDelay(pdMS_TO_TICKS(1000));
	}
}